benchmark/postgresql/web_config/06-04-2023_1680804219.txt

1, WRITE master, options clients=50 transactions=500 threads=6 
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 50
query mode: simple
number of clients: 50
number of threads: 6
number of transactions per client: 500
number of transactions actually processed: 25000/25000
latency average = 24.203 ms
tps = 2065.877303 (including connections establishing)
tps = 2066.021965 (excluding connections establishing)

1, READ master [1], options clients=100 transactions=1000 threads=6 
transaction type: <builtin: select only>
scaling factor: 50
query mode: simple
number of clients: 100
number of threads: 6
number of transactions per client: 1000
number of transactions actually processed: 100000/100000
latency average = 6.044 ms
tps = 16544.892825 (including connections establishing)
tps = 16546.963781 (excluding connections establishing)

2, WRITE master, options clients=100 transactions=1000 threads=6 
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 50
query mode: simple
number of clients: 100
number of threads: 6
number of transactions per client: 1000
number of transactions actually processed: 100000/100000
latency average = 38.187 ms
tps = 2618.711976 (including connections establishing)
tps = 2618.783625 (excluding connections establishing)

2, READ master [2], options clients=200 transactions=2000 threads=6 
transaction type: <builtin: select only>
scaling factor: 50
query mode: simple
number of clients: 200
number of threads: 6
number of transactions per client: 2000
number of transactions actually processed: 400000/400000
latency average = 7.011 ms
tps = 28524.648220 (including connections establishing)
tps = 28530.524388 (excluding connections establishing)

3, WRITE master, options clients=150 transactions=1500 threads=6 
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 50
query mode: simple
number of clients: 150
number of threads: 6
number of transactions per client: 1500
number of transactions actually processed: 225000/225000
latency average = 98.254 ms
tps = 1526.653224 (including connections establishing)
tps = 1526.661303 (excluding connections establishing)

3, READ master [3], options clients=300 transactions=3000 threads=6 
transaction type: <builtin: select only>
scaling factor: 50
query mode: simple
number of clients: 300
number of threads: 6
number of transactions per client: 3000
number of transactions actually processed: 900000/900000
latency average = 11.705 ms
tps = 25631.143830 (including connections establishing)
tps = 25632.366986 (excluding connections establishing)

4, WRITE master, options clients=200 transactions=2000 threads=6 
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 50
query mode: simple
number of clients: 200
number of threads: 6
number of transactions per client: 2000
number of transactions actually processed: 336000/400000
latency average = 147.385 ms
tps = 1356.990772 (including connections establishing)
tps = 1357.001190 (excluding connections establishing)
Try again
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 50
query mode: simple
number of clients: 200
number of threads: 6
number of transactions per client: 2000
number of transactions actually processed: 112000/400000
latency average = 222.632 ms
tps = 898.342540 (including connections establishing)
tps = 898.349163 (excluding connections establishing)
Try again
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 50
query mode: simple
number of clients: 200
number of threads: 6
number of transactions per client: 2000
number of transactions actually processed: 336000/400000
latency average = 145.914 ms
tps = 1370.670746 (including connections establishing)
tps = 1370.675993 (excluding connections establishing)
Try again