benchmark/postgresql/web_config/test_01-04-2023_1680308248.txt

1, WRITE master, options clients=50 transactions=500 threads=6 
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 50
query mode: simple
number of clients: 50
number of threads: 6
number of transactions per client: 500
number of transactions actually processed: 25000/25000
latency average = 36.402 ms
tps = 1373.565872 (including connections establishing)
tps = 1373.631419 (excluding connections establishing)

1, READ master [1], options clients=150 transactions=1500 threads=6 
transaction type: <builtin: select only>
scaling factor: 50
query mode: simple
number of clients: 150
number of threads: 6
number of transactions per client: 1500
number of transactions actually processed: 225000/225000
latency average = 7.579 ms
tps = 19792.267574 (including connections establishing)
tps = 19793.676432 (excluding connections establishing)

2, WRITE master, options clients=100 transactions=1000 threads=6 
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 50
query mode: simple
number of clients: 100
number of threads: 6
number of transactions per client: 1000
number of transactions actually processed: 100000/100000
latency average = 142.777 ms
tps = 700.395030 (including connections establishing)
tps = 700.401454 (excluding connections establishing)

2, READ master [2], options clients=300 transactions=3000 threads=6 
transaction type: <builtin: select only>
scaling factor: 50
query mode: simple
number of clients: 300
number of threads: 6
number of transactions per client: 3000
number of transactions actually processed: 900000/900000
latency average = 10.316 ms
tps = 29081.066046 (including connections establishing)
tps = 29084.617994 (excluding connections establishing)

3, WRITE master, options clients=150 transactions=1500 threads=6
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 50
query mode: simple
number of clients: 150
number of threads: 6
number of transactions per client: 1500
number of transactions actually processed: 168000/225000
latency average = 124.386 ms
tps = 1205.925630 (including connections establishing)
tps = 1205.935736 (excluding connections establishing)
Try again
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 50
query mode: simple
number of clients: 150
number of threads: 6
number of transactions per client: 1500
number of transactions actually processed: 225000/225000
latency average = 106.482 ms
tps = 1408.692125 (including connections establishing)
tps = 1408.705994 (excluding connections establishing)

3, READ master [3], options clients=450 transactions=4500 threads=6 
Try again
transaction type: <builtin: select only>
scaling factor: 50
query mode: simple
number of clients: 450
number of threads: 6
number of transactions per client: 4500
number of transactions actually processed: 2025000/2025000
latency average = 14.813 ms
tps = 30378.147621 (including connections establishing)
tps = 30379.039749 (excluding connections establishing)

# 4, WRITE master, options clients=200 transactions=2000 threads=6
# Try again
# transaction type: <builtin: TPC-B (sort of)>
# scaling factor: 50
# query mode: simple
# number of clients: 200
# number of threads: 6
# number of transactions per client: 2000
# number of transactions actually processed: 224000/400000
# latency average = 151.103 ms
# tps = 1323.601622 (including connections establishing)
# tps = 1323.623198 (excluding connections establishing)