benchmark/postgresql/web_config/test_01-04-2023_1680318727.txt

1, WRITE master, options clients=50 transactions=500 threads=6 
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 50
query mode: simple
number of clients: 50
number of threads: 6
number of transactions per client: 500
number of transactions actually processed: 25000/25000
latency average = 36.072 ms
tps = 1386.110517 (including connections establishing)
tps = 1386.169665 (excluding connections establishing)

1, READ master [1], options clients=150 transactions=1500 threads=6 
transaction type: <builtin: select only>
scaling factor: 50
query mode: simple
number of clients: 150
number of threads: 6
number of transactions per client: 1500
number of transactions actually processed: 225000/225000
latency average = 7.077 ms
tps = 21195.262420 (including connections establishing)
tps = 21197.899973 (excluding connections establishing)

2, WRITE master, options clients=100 transactions=1000 threads=6 
Try again
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 50
query mode: simple
number of clients: 100
number of threads: 6
number of transactions per client: 1000
number of transactions actually processed: 100000/100000
latency average = 59.131 ms
tps = 1691.146054 (including connections establishing)
tps = 1691.171914 (excluding connections establishing)

2, READ master [2], options clients=300 transactions=3000 threads=6 
transaction type: <builtin: select only>
scaling factor: 50
query mode: simple
number of clients: 300
number of threads: 6
number of transactions per client: 3000
number of transactions actually processed: 900000/900000
latency average = 10.416 ms
tps = 28802.278518 (including connections establishing)
tps = 28805.825629 (excluding connections establishing)

3, WRITE master, options clients=150 transactions=1500 threads=6 
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 50
query mode: simple
number of clients: 150
number of threads: 6
number of transactions per client: 1500
number of transactions actually processed: 225000/225000
latency average = 158.868 ms
tps = 944.182729 (including connections establishing)
tps = 944.188574 (excluding connections establishing)

3, READ master [3], options clients=450 transactions=4500 threads=6 
transaction type: <builtin: select only>
scaling factor: 50
query mode: simple
number of clients: 450
number of threads: 6
number of transactions per client: 4500
number of transactions actually processed: 2025000/2025000
latency average = 14.782 ms
tps = 30443.093257 (including connections establishing)
tps = 30443.988710 (excluding connections establishing)